Autodesk.Revit.DB.EdgeEndPoint.Evaluate
Evaluate the end point of the edge in 3d coordinates.
Returns:
The end point of the edge in 3d coordinates.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to evaluate the end point of the edge.
Since:
2021

Autodesk.Revit.DB.EdgeEndPoint.Equals(Autodesk.Revit.DB.EdgeEndPoint)
Determines whether this EdgeEndPoint is equal to another.
other:
The EdgeEndPoint with which to compare this EdgeEndPoint.
Returns:
True if the given EdgeEndPoint is equal to this one, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.EdgeEndPoint.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.EdgeEndPoint.Index
The  index of the start or the end point of an Edge: 0 is the start point, 1 is the end point.
Since:
2021

Autodesk.Revit.DB.EdgeEndPoint.Edge
The Edge.
Since:
2021

Autodesk.Revit.DB.EdgeEndPoint.#ctor(Autodesk.Revit.DB.Edge,System.Int32)
Constructs an instance of EdgeEndPoint.
edge:
The Edge.
index:
Use 0 for the start point, 1 for the end point of an Edge.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for index is not 0 or 1.
Since:
2021

Autodesk.Revit.DB.EdgeEndPoint
Represents the start or the end point of an Edge.
Since:
2021